<template>
  <section class="page-tester">
    <TheBanner image="/images/education/fon-2.jpg">
      <h1 class="banner-title">{{ title }}</h1>
      <TheButton type="danger" @click="openModal('formQuestionnaire')">Анкета кандидата на обучение</TheButton>
      <CountDown :end="end" />
    </TheBanner>
    <div class="container">
      <h2 class="h2 my-30 text-center">Зачем учиться функциональному тестированию?</h2>
      <ul class="list--disk mb-20">
        <li><em><b>Это один из самых простых и быстрых способов начать карьеру в ИТ.</b></em> Более 80% наших студентов устраиваются на работу в течение 3 месяцев.</li>
        <li><em><b>Это актуальная и востребованная профессия.</b></em> Тестировщики нужны в любом крупном проекте, на рынке полно интересных вакансий.</li>
        <li><em><b>Это интересно.</b></em> Как нагрузить приложение? Можно ли подменить сертификат на сайте и обмануть сервер? Что будет, если завалить запросами базу данных? Тестировщик всегда на шаг впереди пользователя, его задачи во многом сложнее и динамичнее, чем у разработчика. </li>
      </ul>
    </div>
    <div class="fon-1 py-30">
      <div class="container">
        <p>Наш онлайн-тренинг дает базовые знания, необходимые для успешного профессионального старта. За месяц обучения вы познакомитесь с теорией и основными инструментами тестирования, научитесь заводить дефекты, писать тест-кейсы, составлять чек-листы и опробуете новые умения на практике. Этого более чем достаточно, чтобы начать работать младшим инженером по ручному функциональному тестированию web- или desktop-приложений.</p>
      </div>
    </div>
    <div class="container">
       <the-carousel class="mb-30">
        <div v-for="(image, index) in carousel" :key="index">
          <img :src="image" :alt="'Вакансия ' + index" class="px-40">
        </div>
      </the-carousel>
    </div>
    <div class="container py-30">
      <h4 class="h4 text-center text-bold mb-20">Почему стоит учиться у нас?</h4>
      <h5 class="text-bold">Актуальная программа</h5>
      <p class="mb-10">Мы глубоко погружены в коммерческую разработку и знаем, какие технологии и подходы востребованы на рынке. Поэтому учим только тому, что реально пригодится вам в дальнейшей работе.</p>
      <h5 class="text-bold">Помощь наставника</h5>
      <p class="mb-10">Наставник поможет быстро разобраться с любыми проблемами, будет проверять практические работы и давать полезную обратную связь.</p>
      <h5 class="text-bold">Не только теория</h5>
      <p class="mb-10">Учебный проект длится месяц – за это время вы отработаете на практике все основные активности и задачи, которые решают тестировщики. Проект готовили практикующие эксперты «Мир Данных ИТ», поэтому все учебные кейсы максимально близки к реальным.</p>
      <h5 class="text-bold">Бесплатное вводное занятие и пробный урок</h5>
      <p class="mb-10">
        Вы можете бесплатно посмотреть вводную лекцию <a v-scroll-to="'#base-course'" class="accent-link">«Введение в профессию»</a> и ознакомиться с форматом подачи и качеством материала.
        Плюс мы еженедельно проводим бесплатные пробные уроки: после выполнения тестового задания вы получите обратную связь от тренера.
        <a @click="openModal('formTrialLesson')" class="accent-link">Записывайтесь!</a>
        Если понравится, сможете легко продолжить обучение в платном формате.
      </p>
      <h5 class="text-bold">Удобство и доступность</h5>
      <p class="mb-10">Тренинг подходит даже тем, кто ничего не знает о тестировании ПО. Вы сможете заниматься где и когда вам удобно, поэтому прохождение тренинга можно совмещать с учебой или работой.</p>
      <h5 class="text-bold">Качественный контент</h5>
      <p class="mb-10">Мы подготовили качественные, хорошо смонтированные видеоролики с профессиональной озвучкой и наглядными иллюстрациями. Материал подается доступно и интересно.</p>
      <h5 class="text-bold">Сертификат, стажировка и даже работа</h5>
      <p>Всем, кто успешно завершит тренинг, мы выдаем сертификат – он заметно повысит интерес работодателей к вашему резюме. Лучшим студентам мы готовы предложить 3-месячную стажировку с перспективой дальнейшей работы в «Мир данных ИТ».</p>
    </div>
    <div class="fon-1 py-30">
      <div class="container">
        <a-row :gutter="50" type="flex" align="middle">
          <a-col :md="24" :lg="6">
            <div class="d-flex justify-content-center my-10">
              <img src="/images/education/tester/quote-3.webp" alt="Анастасия Гилевич" class="round-img" style="max-width: 350px;">
            </div>
          </a-col>
          <a-col :md="24" :lg="18">
            <blockquote>
              <p>При разработке тренинга мы ориентировались на тех, кто хочет оперативно получить необходимую базу и сразу начать работать по профессии. Занятия продлятся месяц: это будет достаточно быстрое, но глубокое погружение. Мы старались создать максимально полезную программу, которая базируется на теории, но также позволяет подкрепить знания отличными практическими занятиями. При подготовке к тренингу мы проработали практические задания с лучшими экспертами «Мир Данных ИТ», чтобы сделать их как можно более реалистичными. В результате получился тренинг, который обеспечит вам отличный старт на рынке ИТ. С таким набором знаний у вас будет возможность быстро заинтересовать работодателей, а практический опыт решения базовых задач поможет влиться в рабочий процесс. Помните, что функциональное тестирование – это основа, с которой начинается все. Это не только один из самых доступных способов стать ИТ-специалистом, но и очень многогранная профессия. В будущем вы сможете выбрать любой интересный вам вектор развития – от автоматизации тестирования до тим-менеджмента</p>
              <cite><b>Анастасия Гилевич</b>, создатель тренинга по функциональному тестированию.</cite>
            </blockquote>
          </a-col>
        </a-row>
      </div>
    </div>
    <div class="container py-30 lists--disk" id="base-course">
      <h4 class="h4 text-center text-bold mb-30">Хочу стать тестировщиком.</h4>
      <a-collapse>
        <a-collapse-panel v-for="(courseItem, index) in course" :key="index" :header="courseItem.title">
          <div v-html="courseItem.content"></div>
        </a-collapse-panel>
      </a-collapse>
    </div>
    <ParCertificate />
    <StartLearning />
  </section>
</template>

<script>
import TheBanner from '~/components/base/TheBanner.vue'
import TheCarousel from '~/components/base/TheCarousel.vue'
import ApplicationForTraining from '~/components/blocks/ApplicationForTraining.vue'
import MainForm from '~/components/forms/MainForm.vue'
import WhyAreWe from '~/components/blocks/WhyAreWe.vue'
import TheTimeline from '~/components/base/TheTimeline.vue'
import ParCertificate from "~/components/partials/ParCertificate";
import TheButton from "~/components/base/TheButton";
import StartLearning from "@/components/blocks/StartLearning";
import CountDown from "~/components/base/CountDown";

export default {
  name: "Tester",
  head() {
    return {
      titleTemplate: this.title,
    }
  },
  components: {
    CountDown,
    StartLearning,
    TheButton,
    ParCertificate,
    TheBanner,
    TheCarousel,
    ApplicationForTraining,
    MainForm,
    WhyAreWe,
    TheTimeline
  },
  data() {
    return {
      title: 'Тестировщик ПО',
      end: new Date(2021, 5, 1).getTime(),
      carousel: ['/images/education/tester/RFP_1.jpg', '/images/education/tester/RFP_2.jpg', '/images/education/tester/RFP_3.jpg', '/images/education/tester/RFP_4.jpg'],
      why: [
        {
          title: 'Обучение под конкретные реальные проекты',
          content: 'Вы приобретете базовые навыки разработки тестовой документации для функционального веб-тестирования'
        },
        {
          title: 'Наставник',
          content: 'В течение всего обучения у вас будет личный Наставник. Он поможет вам быстро разобраться со всеми проблемами, на которые в ином случае ушли бы недели. Также он проверит выполнение практических работ после каждого блока обучения и проведет один раз в неделю вебинар с разбором материала и ответами на вопросы.'
        },
        {
          title: 'Практика в специально разработанном учебном проекте',
          content: 'Вы отработаете на практике все этапы процесса тестирования. Поработаете над Проектом, длительностью 1 месяц с 2 спринтами разработки (периоды работы с указанием этапа доработок программного продукта).'
        }
      ],
      skills: [
        '<ul><li>Понимать базовые термины тестирования и выполнять все востребованные виды тестирования в IT</li><li>Освоите принципы проведения тестирования с документацией и при ее отсутствии, получите практический опыт по составлению тестовой документации</li></ul>',
        '<ul><li>Тестировать REST API с применением самых популярных инструментов (Postman, SoapUI, Swagger)</li><li>Приобретете базовые навыки работы с SQL</li><li>Отработаете возможности применения популярных плагинов и утилит для качественной работы тестировщика</li></ul>',
        '<ul><li>Тестировать веб-продукты и пользоваться панелью разработчика</li><li>Получите опыт тестирования требований</li><li>Работать с трекинговой системой JIRA и с инструментами ведения чек-листов и тест-кейсов (JIRA, TestLink)</li></ul>'
      ],
      timeline: [
        {
          title: 'Работа с багрекером',
          content: `
          <ul>
            <li>Что такое баг-трекер и какие баг-трекеры бывают.</li>
            <li>Что такое баг, ошибка, дефект и в чем разница.</li>
            <li>Жизненный цикл бага.</li>
            <li>Атрибуты бага и зачем они нужны, как и кем используются.</li>
          </ul>
          `,
        },
        {
          title: 'Теория тест-анализа, основные техники тест-анализа',
          content: `
          <ul>
            <li>Основные техники тест-анализа (эквивалентное разбиение, граничные значения, анализ состояний и переходов, таблицы решений, попарное тестирование)</li>
          </ul>
          `,
        },
        {
          title: 'Тестирование без требований',
          content: `
          <ul>
            <li>Исследовательское тестирование и какие есть подводные камни при таком виде тестирования.</li>
            <li>Отсутствие требований, разбор основных методов исследовательского тестирования (предугадывание ошибок, тестирование на основе чек-листов, тестирование методом свободного поиска, использование тест-туров, сессий тестирования)</li>
          </ul>
          `,
        },
        {
          title: 'Особенности тестирования',
          content: `
          <ul>
            <li>Тестирование веб-приложений</li>
            <li>Инструментарий для тестов веб-приложений.</li>
            <li>Тестирование веб-сервисов с помощью Postman и Swagger.</li>
            <li>Тестирование пользовательского интерфейса.</li>
          </ul>
          `,
        },
        {
          title: 'Разработка тест-дизайна',
          content: `
          <ul>
            <li>Варианты тестовой документации,</li>
            <li>Инструментарий для разработки тест-дизайнов</li>
            <li>Сервисы Google, TestLink, плагин Test Management for JIRA</li>
          </ul>
          `,
        },
        {
          title: 'Отработка практических заданий после каждого урока с проверками от наставника и рекомендациями',
          content: ``,
        },
      ],
      course: [
        {
          title: 'Какие знания нужны, чтобы начать учиться',
          content: `
          <p>
            Для старта вполне хватит полного среднего образования. Быть «технарем» не обязательно, но важно быть достаточно продвинутым пользователем ПК. Помните, что во время работы вам придется быстро осваивать новые программы и технологии. Что касается личных качеств, must have тестировщика – это любопытство, внимательность, настойчивость, здоровый скепсис, перфекционизм, обучаемость, нестандартное мышление и умение работать в команде.
          </p>
          `
        },
        {
          title: 'Чему вы научитесь',
          content: `
          <ul>
            <li>Понимать базовые термины и выполнять все востребованные виды тестирования.</li>
            <li>Проводить тестирование с документацией и без нее, а также составлять тестовую документацию.</li>
            <li>Тестировать web-продукты.</li>
            <li>Работать с баг-трекинговой и тест-трекинговой системами, инструментами ведения чек-листов и тест-кейсов (JIRA, TestLink, Zephyr Scale).</li>
          </ul>
          `
        },
        {
          title: 'Длительность тренинга',
          content: `
           <ul>
            <li>Суммарная длительность тренинга – 1 месяц.</li>
            <li>Каждую неделю вы будете проходить 2 занятия и выполнять 2 практические работы.</li>
            <li>На выполнение каждого задания потребуется от 2 до 6 часов (в зависимости от вашей технической подготовки и знания теории тестирования).</li>
            <li>В конце обучения вас ждет финальное задание, в котором вы отработаете все полученные знания.</li>
          </ul>
          `
        },
        {
          title: 'Стоимость тренинга',
          content: `<p>10 000 руб.</p>`
        },
        {
          title: 'Из каких блоков состоит программа тренинга',
          content: `
          <h5 class="text-bold mb-10">Блок 1. Введение в тестирование.</h5>
          <ul class="mb-15">
            <li>Цели тестирования, почему важно тестировать ПО.</li>
            <li>Ошибки, дефекты и сбои в ПО.</li>
            <li>Что такое тестирование ПО, основные принципы тестирования.</li>
            <li>Функции ПО, валидация и верификация ПО.</li>
            <li>Кто такие тестировщики, чем они занимаются, какими навыками должны обладать.</li>
          </ul>
          <h5 class="text-bold mb-10">Блок 2. Soft Skills и Hard Skills тестировщика.</h5>
          <ul class="mb-15">
            <li>Soft Skills.</li>
            <li>Hard Skills.</li>
            <li>Ошибки начинающих тестировщиков.</li>
          </ul>
          <h5 class="text-bold mb-10">Блок 3. Уровни тестирования. Этапы процесса тестирования.</h5>
          <b>3.1. Уровни тестирования.</b>
          <ul class="mb-15">
            <li>Компонентное (модульное) тестирование.</li>
            <li>Интеграционное тестирование.</li>
            <li>Системное тестирование.</li>
            <li>Приемочное тестирование.</li>
          </ul>
          <b>3.2. Этапы процесса тестирования.</b>
          <ul class="mb-15">
            <li>Анализ требований.</li>
            <li>Планирование тестирования.</li>
            <li>Разработка тестов.</li>
            <li>Выполнение тестов.</li>
            <li>Оценка результатов тестирования.</li>
          </ul>
          <h5 class="text-bold mb-10">Блок 4. Методики тестирования.</h5>
           <ul class="mb-15">
            <li>Метод эквивалентных классов.</li>
            <li>Метод граничных значений.</li>
            <li>Метод декомпозиции.</li>
          </ul>
          <h5 class="text-bold mb-10">Блок 5. Виды тестирования. Виды программного обеспечения.</h5>
           <ul class="mb-15">
            <li>Классификация видов программ. </li>
            <li>Классификация видов тестирования.</li>
            <li>Обзор функциональных видов тестирования.</li>
          </ul>
          <h5 class="text-bold mb-10">Блок 6. Модели процесса разработки. Тестирование в Agile процессе.</h5>
          <ul class="mb-15">
            <li>Модели процесса разработки.</li>
            <li>Тестирование в Agile.</li>
          </ul>
           <h5 class="text-bold mb-10">Блок 7. Работа с баг-трекером и тест-трекером.</h5>
           <b>7.1 Что такое баг-трекер.</b>
           <ul class="mb-15">
            <li>Оформление дефекта в баг-трекере.</li>
            <li>Знакомство с JIRA.</li>
           </ul>
           <b>7.2 Работа с тест-трекером. </b>
           <ul class="mb-15">
            <li>Что такое тест-кейс.</li>
            <li>Знакомство с TestLink.</li>
            <li>Знакомство с плагином для ведения тест-кейсов Zephyr Scale.</li>
          </ul>
          <strong>Итоговая практическая работа «Проект по тестированию сайта».</strong>
          `
        },
        {
          title: 'Вводная лекция «Введение в профессию»',
          content: `
          <div class="container d-flex justify-content-center py-40">
            <iframe width="710" height="400" src="https://www.youtube.com/embed/evs4aAp8Uo0" title="Видеокурс по функциональному тестированию" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
          </div>
          `
        }
      ],
    }
  },
  methods: {
    openModal(name) {
      this.$store.commit('toggleModal', name)
    },
  }
}
</script>

<style lang="scss">
  .skills {
    ul, li {
      list-style: unset;
    }
    ul {
      padding-left: 18px;
    }
  }
</style>
