<template>
  <section class="page-analyst">
    <TheBanner image="/images/education/analyst/eFmM48sH.jpg">
      <h1 class="banner-title">{{ title }}</h1>
      <TheButton type="danger" @click="openModal('formQuestionnaire')">Анкета кандидата на обучение</TheButton>
    </TheBanner>
    <div class="container py-40">
      <strong>Кто такой, аналитик и чем занимается?</strong>
      <p>
        На крупных сайтах вакансий можно встретить как предложения работы бизнес-аналитиком, так и системным аналитиком. В чем разница между этими двумя профессиями? Бизнес-аналитик выявляет потребности бизнеса, оценивает их, принимает решения по изменению существующих процессов и инициирует доработку IT-системы. Системный аналитик формулирует требования к IT-системе и описывает задачи для разработчиков. Роль системного и бизнес-аналитика часто выполняет один человек. Поэтому мы обучаем системному и бизнес-анализу в IT, чтобы наши выпускники были наиболее востребованы на рынке труда. Мы научим вас описывать и анализировать бизнес-процессы, разрабатывать технические задания, говорить на одном языке с разработчиками и работать в команде по различным методологиям.
      </p>
     </div>
    <div class="fon-1 py-30">
      <div class="container">
        <WhyAreWe :items="why" />
      </div>
    </div>
    <div class="container py-40">
      <h2 class="h2 text-center">ЧЕМУ ВЫ НАУЧИТЕСЬ И ЧТО БУДЕТЕ УМЕТЬ</h2>
      <a-row class="py-20">
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>Познакомитесь с основными терминами, задачами и инструментами анализа данных. Научитесь подготавливать данные для анализа. Познакомитесь с языком программирования Python, аналитической библиотекой Pandas и средой программирования Jupyter</li>
            <li>Научитесь определять стейкхолдеров проекта, выявлять возможные риски, создавать модели бизнес-процессов в самых популярных нотациях</li>
          </ul>
        </a-col>
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>Освоите основные методологии разработки, проектирования баз данных и долговременных хранилищ. Поработаете с MySQL и познакомитесь с альтернативными базами данных</li>
            <li>Пройдете путь от основ программирования до автоматизации, сбора, обработки, анализа и визуализации данных</li>
            <li>Освоите парсинг и работу с API, а также научитесь использовать основные библиотеки анализа данных</li>
          </ul>
        </a-col>
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>Изучите нотации и технологии: UML, SOAP, REST API, XML, XHTML</li>
            <li>Научитесь использовать Postman, Draw.io, IBM Doors, продукты Atlassian</li>
            <li>Освоите современные инструменты системного и бизнес-аналитика Excel, SQL, UML, Google Analytics, Яндекс Метрика, Power I, Tableau, Python, Draw.io, Git, Trello, Confluence, Pandas, Power Point</li>
          </ul>
        </a-col>
      </a-row>
    </div>
    <div class="fon-1 py-30">
      <div class="container">
        <h3 class="h3 mb-20 text-center text-bold">Стажировка с последующим трудоустройством от компании МИР ДАННЫХ ИТ для лучших выпускников</h3>
        <p>Наша цель — ваше трудоустройство и успех в профессии.</p>
        <p>Целью программы обучения является подготовка системного/бизнес аналитика под конкретные задачи и проекты.</p>
        <p>Наш курс для тех:</p>
        <p>- кто хочет сменить профессию</p>
        <p>- кто уже развивается в IT-сфере</p>
        <p>Мы дадим всю необходимую теоретическую базу и познакомим с необходимыми инструментами для уверенного старта в профессии. Вы не только освоите востребованные навыки системного/бизнес аналитика, но и приобрете практическим опыт на учебном проекте.</p>
        <p>Курс проводится в онлайн-режиме.</p>
        <p>По окончании курса слушатели, успешно прошедшие его, получат сертификат, а также возможность пройти стажировку в течение 3 месяцев и закрепить полученные в ходе обучения навыки. Чтобы попасть на курс, <a href="#" class="accent-link" @click.prevent="openModal('formQuestionnaire')">заполните анкету</a> или заполните форму <a href="#" class="accent-link" v-scroll-to="'#page-form'">ниже</a></p>
      </div>
    </div>
    <div class="container py-30">
      <h4 class="h4 text-center mb-30">Программа обучения</h4>
      <TheTimeline :items="timeline" />
    </div>
    <ParCertificate />
<!--
    <div class="fon-1 py-30">
      <div class="container">
        <a-row>
          <a-col :sm="24" :md="12" class="px-30">
            <h3 class="h3 mb-20">Некоторые факты о аналитике</h3>
            <p>Мы живём во времена, когда количество информации очень быстро растёт. Но толку от этих данных нет, если просто собирать и хранить. Уверен, что любой бизнесмен хочет оптимизировать свой бизнес, понять где можно сэкономить, в какую часть бизнеса лучше вложить деньги, чтобы в будущем заработать, привлечь больше клиентов. Для этого и нужен человек, который умеет получить из данных полезную информацию. Сейчас у любой большой компании куча данных, по этому и спрос на специалистов большой. Отчасти аналитика была всегда, просто не в таких масштабах.Область отделилась, раньше таких людей можно было просто назвать математиком, эконометристом, а сейчас это наука (Data Science)</p>
          </a-col>
          <a-col :sm="24" :md="12">
            <img v-lazy="'/images/education/analyst/c70ef3d899cb8e1be1c0.jpg'" alt="Некоторые факты о аналитике">
          </a-col>
        </a-row>
      </div>
    </div>
    <div class="container py-30">
      <FeaturesCard
        :title="questions.title"
        :content="questions.content"
      ></FeaturesCard>
    </div>
-->
    <div class="container my-50 d-flex justify-content-center">
      <a-button type="danger" :disabled="true">Узнать стоимость и оплатить</a-button>
    </div>
    <div class="container my-50" id="page-form">
      <a-row type="flex">
        <a-col :xs="24" :sm="24" :md="{span: 12, offset: 6}">
          <MainForm
            title="По вопросам обучения. Свяжитесь с нами"
            button-title="Перезвоните мне"
            button-alight="center"
            :fields="$store.getters.formsFields.namePhone"
          ></MainForm>
        </a-col>
      </a-row>
    </div>
  </section>
</template>

<script>
import TheBanner from '~/components/base/TheBanner.vue'
import MainForm from '~/components/forms/MainForm.vue'
import WhyAreWe from '~/components/blocks/WhyAreWe.vue'
import TheTimeline from '~/components/base/TheTimeline.vue'
import FeaturesCard from '~/components/base/FeaturesCard.vue'
import ParCertificate from "~/components/partials/ParCertificate";
import TheButton from "~/components/base/TheButton";
export default {
  name: "Analitik",
  head() {
    return {
      titleTemplate: this.title,
    }
  },
  components: {TheButton, TheBanner, MainForm, WhyAreWe, TheTimeline, FeaturesCard, ParCertificate },
  data() {
    return {
      title: 'Системный аналитик Обучение и стажировка',
      subTitle: 'Быстрый и качественный консалтинг в сфере бизнес и цифровой аналитики с большим объемом материала перед трудоустройством на крупные долгоиграющие проекты с гарантией и бесплатным сопровождением',
      why: [
        {
          title: 'Обучение под конкретные реальные проекты',
          content: 'Вы приобретете базовые навыки бизнес и системной аналитики'
        },
        {
          title: 'Наставник',
          content: 'В течение всего обучения у вас будет личный Наставник. Он поможет вам быстро разобраться со всеми проблемами, на которые в ином случае ушли бы недели. Также он проверит выполнение практических работ после каждого блока обучения и проведет один раз в неделю вебинар с разбором материала и ответами на вопросы.'
        },
        {
          title: 'Практика в специально разработанном учебном проекте',
          content: 'Отработка на практике всех этапов процесса аналитики. Моделирование работы над Проектом.'
        }
      ],
      timeline: [
        {
          title: 'Вводная часть',
          content: `
            <ul class="list--disk">
                <li>Роль аналитика: бизнес, системный анализ. Сбор требований, разделение на бизнес, системного аналитика.</li>
                <li>Требования к ПО: назначение, структура,критерии качества, примеры (неоднозначных требований, последствия неполных, неоднозначных требований)</li>
                <li>Этапы разработки ПО (обследование, проектирование, разработка, тестирование, опытная эксплуатация, продакшн)</li>
                <li>Представление о подходах к разработки современных информационных систем.</li>
                <li>Тестовое задание. Изучение доп.материалов</li>
            </ul>
          `,
        },
        {
          title: 'Обследование, получение и формирование (формализация) требований к ПО',
          content: `
          <ul class="list--disk direction--rtl">
              <li>Методы обследования. Формализация требований. Основные документы, содержащие требования к ИС (ТЗ, ОПЗ, спецификации, юзкейсы и т.п)</li>
              <li>Стандарты оформления документов (ГОСТ, РД)</li>
              <li>Техническое задание, основные разделы, их назначение</li>
              <li>Анализ регламентирующих документов, НПА. Виды регламентирующих документов, подходы к анализу и учету требований. Примеры</li>
              <li>Схемы БП. Возможные нотации, примеры</li>
              <li>Самостоятельное задание + проверка</li>
          </ul>
          `,
        },
        {
          title: 'Статусы, типы данных',
          content: `
         <ul class="list--disk">
            <li>Статусы основных сущностей, схема статусов</li>
            <li>Самостоятельное задание +проверка.</li>
            <li>Проектирование логической структуры БД, доменная модель</li>
            <li>Типы данных, типы связей , нотации и др</li>
            <li>Тестовые задания. Самостоятельное задание + проверка</li>
            <li>Проектирование экранных форм (ГУИ): подходы, принципы, инструменты и др</li>
            <li>Связь с лог. моделью данных. Самостоятельное задание + проверка</li>
         </ul>
          `,
        },
        {
          title: 'Оформление',
          content: `
         <ul class="list--disk direction--rtl">
              <li>Спецификации, юзкейсы: выявление основных сценариев использования на основании ТЗ, высокоуровневых требований, альтернативные сценарии; общие требования. Схема юзкейсов</li>
              <li>Самостоятельное задание + проверка</li>
              <li>Тестовое задание</li>
              <li>Документация оформление, общие требования, принципы, примеры</li>
              <li>Версионность документов, обработка замечаний, рецензирование</li>
              <li>Самостоятельное задание + проверка</li>
          </ul>
          `,
        },
        {
          title: 'Интеграция',
          content: `
           <ul class="list--disk">
              <li>Возможные способы интеграции ИС (взаимодействия информационных систем)</li>
              <li>Проектирование информационных взаимодействий: возможные способы, форматы, требования к проектированию</li>
              <li>Диаграмма последовательностей</li>
              <li>Общие знания (представление) SQL – запросы</li>
          </ul>
          `,
        },
      ],
      questions: {
        title: 'Частые вопросы',
        content: `
          <b class="mb-10 d-block">Деятельность, функции и необходимые скиллы для аналитиков из IT-сферы</b>
          <b class="d-block">Бизнес-аналитик</b>
          <p>
              Основная цель бизнес-аналитика – это удовлетворение потребностей бизнеса в развитии. Как известно, любой бизнес преследует одну цель - прибыль,и бизнес-аналитик призван улучшать бизнес-показатели.
              Для этого бизнес-аналитик выявляет потребности бизнеса, оценивает их, принимает решения по изменению существующих бизнес-процессов или внедрению новых. На плечах бизнес-аналитика также лежит задача описания возможных сценариев развития бизнеса.
          </p>
          <b>Аналитик данных, он же Data Analyst (DA)</b>
          <p>Чем занимается DA. Это...</p>
          <ul class="list-default">
              <li>Построение аналитических отчетов с помощью таких инструментов, как Tableau, Power BI и т.д.;</li>
              <li>Сбор, очистка и подготовка данных с использованием, например, SQL и/или Python;</li>
              <li>Сегментация клиентской базы, построение моделей, разработка инструментов на основе существующих моделей;</li>
              <li>Написание и оптимизация алгоритмов машинного обучения (ML) – часто это вотчина DS, о которых пойдёт речь чуть ниже.</li>
          </ul>
          <p>
              Аналитик данных работает в тесном взаимодействии с бизнес-заказчиками, коими могут выступать менеджеры по продукту, проджект-менеджеры и т.д. Т.е. DA отвечает на вопросы бизнеса: "почему метрика упала?", "проведи A/B тест и скажи, что лучше", "выгрузи клиентов с высокой долей потребления тёмной материи".
          </p>
          <p>
              DA нужно понимать, что такое статистика, проверка гипотез; он умеет в математику, но не самом высоком уровне. А вот когда такого рода компетенции достигают хардового уровня, мы говорим о Data Scientist'ах.
          </p>
          <b>Data Scientist (DS)</b>
          <p>
              DS – тот, кто структурирует и анализирует большие объёмы данных, применяя M DS очень похож на DA, но акцент в скиллах смещён в сторону технической составляющей. И степень определенности в данных, с которыми работает DS меньше. Именно поэтому DS'ы прибегают к машинному обучению, глубокому обучению (DL) – там, где человек уже давно бы забился в угол и потерял всякий рассудок, компьютер эффективно справляется с валидацией математических моделей.
          </p>
          <p>
              Тот набор задач, что выполняют аналитики, часто требует высшего технического образования (временами + профильное/доменное образование). В зависимости от уровня аналитики, требуется хорошее знание математической статистики, бизнеса; владение различного рода инструментами анализа,появляются новые фреймворки, инструменты, подходы и методы, т.е. аналитики вынуждены всё время развиваться, чтобы оставаться на гребне волны. Это затратно, и соответственно, такие специалисты дорого обходятся бизнесу.
          </p>
          <p>
              Но почему же бизнес в последнее время проявляет все большую готовность платить таким профессионалам? Дело в том, что с течением времени происходит интенсификация труда – т.е. внедряются все более эффективные средства развития и расширения бизнеса. Рутинные процессы либо отпадают, либо роботизируются.
          </p>
          <p>
              Практически единственным конкурентным преимуществом в таких условиях становится Big Data, имеющаяся у компании. Под Big Data здесь понимаются не только большие массивы данных, но и инструменты работы с ними, т.к. данные сами по себе ничего не говорят – здесь нужен свой "укротитель змей") Вот и получается, что работодатели готовы вкладывать значительные средства в аналитику, потому что иначе их обгонят на следующем повороте.
          </p>
        `,
      }
    }
  },
  methods: {
    openModal(name) {
      this.$store.commit('toggleModal', name)
    },
  }
}
</script>

<style lang="scss" scoped>
  @import "../../assets/scss/utils/vars";
  .fon-1 {
    background-color: $apricot-color;
  }
</style>
