<template>
  <section class="page-analyst">
    <TheBanner image="/images/education/analyst/eFmM48sH.jpg">
      <h1 class="banner-title">{{ title }}</h1>
      <p class="banner-subtitle">{{ subTitle }}</p>
    </TheBanner>
    <div class="container py-40">
      <strong>Кто такой, аналитик и чем занимается?</strong>
      <p class="mb-20">
        Бизнес-аналитик выявляет потребности бизнеса, оценивает их, принимает решения по изменению существующих процессов и инициирует доработку IT-системы.
        Системный аналитик формулирует требования к IT-системе и описывает задачи для разработчиков.Роль системного и бизнес-аналитика часто выполняет один человек.
        Поэтому мы обучаем системному и бизнес-анализу в IT, чтобы наши выпускники были наиболее востребованы на рынке труда.Для учебы достаточно школьных знаний. Мы научим вас описывать и анализировать бизнес-процессы, разрабатывать технические задания, говорить на одном языке с разработчиками и работать в команде по различным методологиям.
      </p>
      <p>Аналитик данных — это специалист, который собирает, обрабатывает, изучает и интерпретирует данные. Его работа помогает принимать решения в бизнесе, управлении и науке. Аналитика есть в телекоме, банках, играх, консалтинге ― там, где собирают данные.</p>
      <p>Работодатели ждут от аналитика данных:</p>
      <ul class="list-default">
        <li>знания хотя бы одного языка программирования ― Python или R;</li>
        <li>умения писать запросы к базам данных SQL;</li>
        <li>умения показать выводы и метрики в виде понятного дашборда. Например с помощью инструментов Tableau, Power BI или Amplitude;</li>
        <li>желания разбираться в бизнес-процессах. Опытные программисты с сильной математикой, которые не готовы думать в терминах задач бизнеса, не смогут добиться успеха в роли аналитика данных.</li>
        <li>знания, что такое статистика и гипотеза. Серьезная математика не пригодится, главное ориентироваться в понятиях.</li>
        <li>умения работать с Яндекс.Метрикой или Google Analytics. Обычно это необязательное требование.</li>
      </ul>
      <p>Предпосылки, связанные с общей тенденцией на всей планете - развитие ИКТ (информационно-коммуникационные технологии):</p>
      <ul class="list-default">
        <li>научно-технический прогресс</li>
        <li>глобализация</li>
        <li>цифровизация</li>
      </ul>
      <p>Вот , что происходит прямо сейчас в социально-экономической системе благодаря "цифрофизации":</p>
      <ul class="list-default mb-20">
        <li>преодолевается цифровое неравенство и появляется больше возможностей для каждого: сегодня тот, у кого есть выход в Сеть, может начать заниматься образованием, бизнесом и не только.</li>
        <li>скорость во всем, начиная от электронной почты и заканчивая облачными вычислениями взлетели</li>
        <li>переход от массовости производств к индивидуализации: теперь вместо стандартных кроссовок можно заказать в интернет-магазине Nike индивидуальные-неповторимые, а количество производителей продолжает увеличиваться и все выпускают разные продукты</li>
        <li>интеллектуализация продуктов: Amazon доставляет почту дронами ; автомобили способны самостоятельно парковаться и ездить без участия водителя; телефоны выполняют голосовые команды</li>
        <li>понятия "электронных следов": каждое действие пользователя отмечается и сохраняется в Глобальной Сети</li>
        <li>внедрение ИКТ на всех производствах, во все сферы повседневной жизни: станки, которые подключаются к Сети, системы Умного Дома и так далее - все подключается к Глобальной Сети</li>
      </ul>
      <p>Вот исходя только из этого, можно понять, почему так востребованы ИТ-специалисты и те, кто будет собирать, анализировать все данные, которые получает человечество. На основании этих данных, бизнес- и системные аналитики строят модели. Модели позволяют понимать, как существует та или иная система, что позволяет предсказывать поведение системы. Мир усложняется ... а аналитик работает как раз для его упрощения.</p>
    </div>
    <div class="fon-1 py-30">
      <div class="container">
        <WhyAreWe :items="why" />
      </div>
    </div>
    <div class="container py-40">
      <h2 class="h2 text-center">ЧЕМУ ВЫ НАУЧИТЕСЬ И ЧТО БУДЕТЕ УМЕТЬ</h2>
      <a-row class="py-20">
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>основные термины, задачи и инструменты анализа данных. Подготовка данных для анализа. Знакомство с языком программирования Python, аналитической библиотекой Pandas и средой программирования Jupyter</li>
            <li>научитесь определять стейкхолдеров проекта, выявлять возможные риски, создавать модели бизнес-процессов в самых популярных нотациях</li>
          </ul>
        </a-col>
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>основные методологии разработки, проектирование баз данных и долговременные хранилища. Поработаете с MySQL и познакомитесь с альтернативными базами данных</li>
            <li>пройдете путь от основ программирования до автоматизации, сбора, обработки, анализа и визуализации данных.</li>
          </ul>
        </a-col>
        <a-col :sm="24" :md="8">
          <ul class="list-default">
            <li>освоите парсинг и работу с API, а также научитесь использовать основные библиотеки анализа данных</li>
            <li>изучите нотации и технологии: UML, SOAP, REST API, XML, XHTML. Научитесь использовать Postman, Draw.io, IBM Doors, Продукты Atlassian</li>
            <li>Освоите современные инструменты системного и бизнес-аналитика Excel SQL UML Google Analytics Яндекс Метрика Power I Tableau Python Draw.io Git Trello Confluence Pandas Power Point</li>
          </ul>
        </a-col>
      </a-row>
    </div>
    <div class="container py-30">
      <h4 class="h4 text-center mb-30">Программа обучения</h4>
      <TheTimeline :items="timeline" />
    </div>
    <div class="fon-1 py-30">
      <div class="container">
        <a-row>
          <a-col :sm="24" :md="12" class="px-30">
            <h3 class="h3 mb-20">Некоторые факты о аналитике</h3>
            <p>Мы живём во времена, когда количество информации очень быстро растёт. Но толку от этих данных нет, если просто собирать и хранить. Уверен, что любой бизнесмен хочет оптимизировать свой бизнес, понять где можно сэкономить, в какую часть бизнеса лучше вложить деньги, чтобы в будущем заработать, привлечь больше клиентов. Для этого и нужен человек, который умеет получить из данных полезную информацию. Сейчас у любой большой компании куча данных, по этому и спрос на специалистов большой. Отчасти аналитика была всегда, просто не в таких масштабах.Область отделилась, раньше таких людей можно было просто назвать математиком, эконометристом, а сейчас это наука (Data Science)</p>
          </a-col>
          <a-col :sm="24" :md="12">
            <img v-lazy="'/images/education/analyst/c70ef3d899cb8e1be1c0.jpg'" alt="Некоторые факты о аналитике">
          </a-col>
        </a-row>
      </div>
    </div>
    <div class="container py-30">
      <FeaturesCard
        :title="questions.title"
        :content="questions.content"
      ></FeaturesCard>
    </div>
    <div class="container my-50">
      <a-row type="flex">
        <a-col :xs="24" :sm="24" :md="{span: 12, offset: 6}">
          <MainForm
            title="По вопросам обучения. Свяжитесь с нами"
            button-title="Перезвоните мне"
            button-alight="center"
            :fields="$store.getters.formsFields.namePhone"
          ></MainForm>
        </a-col>
      </a-row>
    </div>
  </section>
</template>

<script>
import TheBanner from '~/components/base/TheBanner.vue'
import MainForm from '~/components/forms/MainForm.vue'
import WhyAreWe from '~/components/blocks/WhyAreWe.vue'
import TheTimeline from '~/components/base/TheTimeline.vue'
import FeaturesCard from '~/components/base/FeaturesCard.vue'
export default {
  name: "Analitik",
  head() {
    return {
      titleTemplate: this.title,
    }
  },
  components: { TheBanner, MainForm, WhyAreWe, TheTimeline, FeaturesCard },
  data() {
    return {
      title: 'Системный аналитик Обучение и трудоустройство',
      subTitle: 'Быстрый и качественный консалтинг в сфере бизнес и цифровой аналитики с большим объемом материала перед трудоустройством на крупные долгоиграющие проекты с гарантией и бесплатным сопровождением',
      why: [
        {
          title: 'Обучение под конкретные реальные проекты',
          content: 'Приобретете базовые навыки бизнес и системной аналитики'
        },
        {
          title: 'Наставник',
          content: 'В течение всего обучения у вас будет личный Наставник. Проверка выполнения практических работ после каждого блока обучения, созвон раз в неделю, разбор материала, ответы на вопросы. Он поможет вам быстро разобраться со всеми проблемами, на которые в ином случае ушли бы недели'
        },
        {
          title: 'Практика в специально разработанном учебном проекте',
          content: 'Отработка на практике всех этапов процесса аналитики. Моделирование работы над Проектом, длительностью 1 месяц с 2 спринтами разработки программного продукта'
        }
      ],
      timeline: [
        {
          title: 'Вводная часть',
          content: `
          <p>
            Роль аналитика: бизнес, системный анализ.
            Сбор требований, разделение на бизнес, системного аналитика.
            Требования к ПО: назначение, структура,критерии качества, примеры (неоднозначных требований, последствия неполных, неоднозначных требований)
            Этапы разработки ПО (обследование, проектирование, разработка, тестирование, опытная эксплуатация, продакшн)
            Представление о подходах к разработки современных информационных систем. Тестовое задание. Изучение доп.материалов
          </p>
          `,
        },
        {
          title: 'Обследование, получение и формирование (формализация) требований к ПО:',
          content: `
          <p>
            Методы обследования.
            Формализация требований.
            Основные документы, содержащие требования к ИС (ТЗ, ОПЗ, спецификации, юзкейсы и т.п).
            Стандарты оформления документов (ГОСТ, РД)
            Техническое задание, основные разделы, их назначение
            Анализ регламентирующих документов, НПА. Виды регламентирующих документов, подходы к анализу и учету требований.
            Примеры. Схемы БП. Возможные нотации, примеры.Самостоятельное задание +проверка
          </p>
          `,
        },
        {
          title: 'Статусы, типы данных',
          content: `
          <p>
            Статусы основных сущностей, схема статусов
            Самостоятельное задание +проверка
            Проектирование логической структуры БД, доменная модель.
            Типы данных, типы связей , нотации и др.
            Тестовые задания. Самостоятельное задание +проверка
            Проектирование экранных форм (ГУИ): подходы, принципы, инструменты и др. Связь с лог. Моделью данных. Самостоятельное задание +проверка
          </p>
          `,
        },
        {
          title: 'Оформление',
          content: `
          <p>
            Спецификации, юзкейсы: выявление основных сценариев использования на основании ТЗ, высокоуровневых требований
            альтернативные сценарии; общие требования
            Схема юзкейсов
            Самостоятельное задание +проверка
            Тестовое задание
            Документация оформление, общие требования, принципы, примеры
            Версионность документов, обработка замечаний, рецензирование
            Самостоятельное задание +проверка
          </p>
          `,
        },
        {
          title: 'Интеграция',
          content: `
           <p>
            Возможные способов интеграции ИС (взаимодействия информационных систем)Проектирование информационных взаимодействий (Способы, форматы): возможные способы, форматы, требования к проектированию . Диаграмма последовательностей Общие знания (представление) SQL - запросы
           </p>
          `,
        },
      ],
      questions: {
        title: 'Частые вопросы',
        content: `
          <b class="mb-10 d-block">Деятельность, функции и необходимые скиллы для аналитиков из IT-сферы</b>
          <b class="d-block">Бизнес-аналитик</b>
          <p>
              Основная цель бизнес-аналитика – это удовлетворение потребностей бизнеса в развитии. Как известно, любой бизнес преследует одну цель - прибыль,и бизнес-аналитик призван улучшать бизнес-показатели.
              Для этого бизнес-аналитик выявляет потребности бизнеса, оценивает их, принимает решения по изменению существующих бизнес-процессов или внедрению новых. На плечах бизнес-аналитика также лежит задача описания возможных сценариев развития бизнеса.
          </p>
          <b>Аналитик данных, он же Data Analyst (DA)</b>
          <p>Чем занимается DA. Это...</p>
          <ul class="list-default">
              <li>Построение аналитических отчетов с помощью таких инструментов, как Tableau, Power BI и т.д.;</li>
              <li>Сбор, очистка и подготовка данных с использованием, например, SQL и/или Python;</li>
              <li>Сегментация клиентской базы, построение моделей, разработка инструментов на основе существующих моделей;</li>
              <li>Написание и оптимизация алгоритмов машинного обучения (ML) – часто это вотчина DS, о которых пойдёт речь чуть ниже.</li>
          </ul>
          <p>
              Аналитик данных работает в тесном взаимодействии с бизнес-заказчиками, коими могут выступать менеджеры по продукту, проджект-менеджеры и т.д. Т.е. DA отвечает на вопросы бизнеса: "почему метрика упала?", "проведи A/B тест и скажи, что лучше", "выгрузи клиентов с высокой долей потребления тёмной материи".
          </p>
          <p>
              DA нужно понимать, что такое статистика, проверка гипотез; он умеет в математику, но не самом высоком уровне. А вот когда такого рода компетенции достигают хардового уровня, мы говорим о Data Scientist'ах.
          </p>
          <b>Data Scientist (DS)</b>
          <p>
              DS – тот, кто структурирует и анализирует большие объёмы данных, применяя M DS очень похож на DA, но акцент в скиллах смещён в сторону технической составляющей. И степень определенности в данных, с которыми работает DS меньше. Именно поэтому DS'ы прибегают к машинному обучению, глубокому обучению (DL) – там, где человек уже давно бы забился в угол и потерял всякий рассудок, компьютер эффективно справляется с валидацией математических моделей.
          </p>
          <p>
              Тот набор задач, что выполняют аналитики, часто требует высшего технического образования (временами + профильное/доменное образование). В зависимости от уровня аналитики, требуется хорошее знание математической статистики, бизнеса; владение различного рода инструментами анализа,появляются новые фреймворки, инструменты, подходы и методы, т.е. аналитики вынуждены всё время развиваться, чтобы оставаться на гребне волны. Это затратно, и соответственно, такие специалисты дорого обходятся бизнесу.
          </p>
          <p>
              Но почему же бизнес в последнее время проявляет все большую готовность платить таким профессионалам? Дело в том, что с течением времени происходит интенсификация труда – т.е. внедряются все более эффективные средства развития и расширения бизнеса. Рутинные процессы либо отпадают, либо роботизируются.
          </p>
          <p>
              Практически единственным конкурентным преимуществом в таких условиях становится Big Data, имеющаяся у компании. Под Big Data здесь понимаются не только большие массивы данных, но и инструменты работы с ними, т.к. данные сами по себе ничего не говорят – здесь нужен свой "укротитель змей") Вот и получается, что работодатели готовы вкладывать значительные средства в аналитику, потому что иначе их обгонят на следующем повороте.
          </p>
        `,
      }
    }
  }
}
</script>

<style lang="scss" scoped>
  @import "../../assets/scss/utils/vars";
  .fon-1 {
    background-color: $apricot-color;
  }
</style>
