<template>
  <section class="page-testing-web-service">
    <TheBanner image="/images/education/web-services/web-testing.jpg">
      <h1 class="banner-title">{{ title }}</h1>
      <TheButton type="danger" @click="openGetCourse(3)">Анкета кандидата на обучение</TheButton>
    </TheBanner>
    <div class="container pt-30">
      <p class="mb-10">Большинство современных операционных систем обладают встроенным API. Использование API для взаимодействия программ, сервисов, клиентов с Web сайтами очень распространено. Используют API при экспорте или импорте данных с онлайн-сервисов в десктопные программы, по API возможна интеграция виртуальной АТС с CRM-системами или такими приложениями, как 1С, Google Sheets.</p>
      <p class="mb-10">По API происходит взаимодействие мобильных клиентов и различных онлайн-сервисов для оплаты с банковскими системами, различными онлайн-сервисами по поиску товаров, услуг, цен на них.</p>
      <p class="mb-10">Именно поэтому так важно тестировщику уметь тестировать api, владеть инструментами и методиками тестирования  api сервисов.</p>
      <p class="mb-10">В нашем курсе мы собрали многолетний практический опыт тестирования современных api сервисов, разработанных по технологиям REST, GRPC,GRAFQL. Это позволило нам поделиться  с вами нашим опытом, рекомендациями и практикой работы в реальных проектах, выполненных для наших крупных заказчиков, таких как ОТР2000, Техносерв, Сбербанк, ЛАНИТ, ОТП банк и других.</p>
      <p class="mb-10"></p>
      <p class="mb-10"></p>
    </div>
    <div class="container pt-30">
      <h2 class="h3 mb-20 text-center">{{ title }}</h2>
      <a-collapse class="mb-40">
        <a-collapse-panel header="Какие знания нужны, чтобы начать учиться">
          <p class="mb-10">
            Для старта достаточно полного среднего образования, а также необходимо обладать базовыми знаниями и практическими навыками владения теорией тестирования и навыком работы в баг-трекере, базовыми знаниями английского языка на уровне работы с  «переводчиком google».
          </p>
          <p class="mb-10">
            Если ваших базовых знаний недостаточно, вам будет затруднительно выполнять практические работы, а тренер не сможет уделять время на пояснение как составить чек-лист или зарегистрировать правильно баг-репорт. Эти пояснения даются в рамках базового тренинга
            <nuxt-link to="/education/it-obuchenie-testirovshchik" class="accent-link">«Хочу стать тестировщиком»</nuxt-link>.
          </p>
          <p class="mb-10">
            Если вы не уверены, что знаете все это в должной мере, мы рекомендуем вам пройти наш базовый тренинг «Хочу стать тестировщиком», где вы сможете приобрести необходимые знания и практические навыки.
          </p>
          <p class="mb-10">
            На тренинге будет очень много практических заданий, т.к. основная цель  - научить вас работать с api, а не дать только теорию.
          </p>
        </a-collapse-panel>
        <a-collapse-panel header="Чему вы научитесь">
          <ul class="list--disk">
            <li>Начнете понимать клиент-серверную архитектуру.</li>
            <li>Узнаете разницу между разными технологиями реализации api.</li>
            <li>Научитесь работать с современными фреймворками для тестирования api (Swagger, Postman, плагины для GRPC).</li>
            <li>Научитесь анализировать техническую документацию и поймете, что делать при ее отсутствии.</li>
            <li>Изучите разбор методики тестирования api на конкретном примере и опробуете на практике ее применение.</li>
            <li>Получите очень много практических заданий и сможете реально научиться тестировать api. </li>
            <li>По итогу выполненных работ, без проблем сможете пройти собеседование в проект, где требуются знания api, а благодаря сертификату по результатам обучения в нашем учебном центре, сможете демонстрировать его вашему потенциальному работодателю, т.к. наш учебный центр лицензирован на проведение обучения, а не просто дает бумажку о том, что вы прослушали теоретический курс по этой теме.</li>
          </ul>
        </a-collapse-panel>
        <a-collapse-panel header="Длительность тренинга">
          <ul class="list--disk">
            <li>Суммарная длительность тренинга – 1,5 недели.</li>
            <li>В понедельник проходите 2 занятия и выполняете 2 практические работы  (суммарно 8 заданий по работе с token, работе с инструментом Swagger UI).</li>
            <li>В четверг проходите 2 занятия и выполняете 1 практическую работу (суммарно 5 заданий по теме работы с инструментом Postman, исследовательское тестирование).</li>
            <li>В воскресенье вам открывается доступ к Итоговой практической работе, в рамках которой вы будете практиковаться выполнять весь цикл тестирования api с использованием инструмента Postman, используя описания api в Swagger, технического задания на разработку веб-сайта, с составлением чек-листа проверок и регистрацией дефектов в баг-трекере JIRA.</li>
            <li>На выполнение каждого задания дается 4 дня.</li>
            <li>На выполнение итогового практического задания отводится 3 дня.</li>
          </ul>
        </a-collapse-panel>
        <a-collapse-panel header="Стоимость тренинга">
          <p>6000 рублей</p>
        </a-collapse-panel>
        <a-collapse-panel header="Программа тренинга">
          <div  class="lists-default">
            <p class="mb-10"><b>Урок 1</b></p>
            <ol class="mb-10">
              <li>Особенности клиент-серверной архитектуры</li>
              <li>Что проверять при тестировании клиент-серверной архитектуры?</li>
              <li>Что такое API</li>
              <li>Сравнение подходов SOAP и REST и GRPC</li>
              <li>Как можно вызывать API?</li>
            </ol>
            <p class="mb-10"><b>Урок 2</b></p>
            <ol class="mb-10">
              <li>Инструменты работы с API. Практика</li>
              <li>Swagger</li>
              <li>Идентификация, Аутентификация, Авторизация</li>
              <li>Токен авторизации</li>
              <li>
                <span>Знакомство со структурой Swagger UI</span>
                <ul class="mb-10">
                  <li>Body</li>
                  <li>Headers</li>
                  <li>Статус-коды и возможные ошибки</li>
                  <li>Составляем список поверок  API</li>
                  <li>Алгоритм тестирования REST в Swagger UI</li>
                </ul>
              </li>
              <li><em>Практическая работа 1: Учимся работать с Токен</em></li>
              <li><em>Практическая работа 2: Учимся тестировать в Swagger</em></li>
            </ol>
            <p class="mb-10"><b>Урок 3</b></p>
            <ol class="mb-10">
              <li>
                <span>Postman</span>
                <ul class="mb-10">
                  <li>Меню</li>
                  <li>Collection</li>
                  <li>Request</li>
                  <li>Переменные</li>
                  <li>Get запросы</li>
                  <li>Post запросы</li>
                  <li>Другие запросы</li>
                </ul>
              </li>
              <li>SSL сертификаты</li>
              <li>Настройка SSL сертификатов в Postman</li>
              <li><em>Практическая работа 3: Учимся тестировать в Postman</em></li>
            </ol>
            <p class="mb-10"><b>Урок 4</b></p>
            <ol class="mb-10">
              <li>Чек-лист тестирования REST API</li>
              <li>Итоговая практическая работа - обязательна для получения сертификата</li>
            </ol>
            <p><b>На выполнение каждого задания дается 4 дн</b></p>
          </div>
        </a-collapse-panel>
      </a-collapse>
    </div>
    <ParCertificate />
    <StartLearning script="3" />
  </section>
</template>

<script>
import ParCertificate from "@/components/partials/ParCertificate";
import StartLearning from "@/components/blocks/StartLearning";
import TheBanner from "@/components/base/TheBanner";
import TheButton from "@/components/base/TheButton";
import MainForm from "@/components/forms/MainForm";

export default {
  name: 'TestingWebServices',
  components: {ParCertificate, StartLearning, TheBanner, TheButton, MainForm},
  head() {
    return {
      titleTemplate: this.title,
    }
  },
  data() {
    return {
      title: 'Тестирование веб-сервисов',
    }
  },
  methods: {
    openModal(name) {
      this.$store.commit('toggleModal', name)
    },
    openGetCourse(key) {
      const resolve = this.$router.resolve({ path: `/getcourse/${key}`});
      window.open(resolve.href, '_blank');
    }
  }
}
</script>

<style scoped>

</style>
