<template>
  <section class="page-mobile-testers">
    <TheBanner image="/images/education/mobile-tester/smartphone-1701086.jpg">
      <h1 class="banner-title">{{ title }}</h1>
      <TheButton type="danger" @click="openGetCourse(2)">Анкета кандидата на обучение</TheButton>
    </TheBanner>
    <div class="container pt-30">
      <h2 class="h3 mb-20 text-center">Чему вы научитесь</h2>
      <p class="mb-10">
        Наш тренинг направлен на то, чтобы помочь вам разобраться с особенностями мобильного тестирования,  дать ответы на вопросы по организации и алгоритму выполнения мобильного тестирования, помочь с основными трудностями, возникающими при тестировании мобильных приложений.
      </p>
      <p class="mb-10">
        Во время прохождения тренинга вы узнаете, какие бывают подходы к стратегии мобильного тестирования, как выбрать устройства, как работать с эмуляторами и фермами устройств, научитесь анализировать трафик, подменять данные в запросах с помощью современного инструмента Fiddler.
      </p>
      <p class="mb-10">
        Основное внимание уделяется тестированию мобильных приложений с платформой Android, как с наиболее распространённой мобильной ОС на данный момент. Мы специально не делаем акцент на платформе IOS, т.к. наличие MAC OS и смартфонов на платформе IOS сильно ограничивает возможности наших студентов для прохождения тренинга. Тот базис знаний, который мы рассматриваем для платформы Android достаточен для применения и в тестировании под IOS.
      </p>
      <p class="mb-10">
        В  тренинге много практических заданий, которые позволят вам в полной мере на примере учебного мобильного приложения научиться применять полученные знания на практике.
      </p>
    </div>
    <div class="fon-1 py-30 my-40">
      <div class="container">
        <a-row :gutter="50" type="flex" align="middle">
          <a-col :md="24" :lg="6">
            <div class="d-flex justify-content-center my-10">
              <img src="/images/education/tester/quote-3.webp" alt="Анастасия Гилевич" class="round-img" style="max-width: 350px;">
            </div>
          </a-col>
          <a-col :md="24" :lg="18">
            <blockquote>
              <p>При разработке тренинга мы ориентировались на потребность наших инженеров  по тестированию в получении практических знаний и навыков работы с инструментами, необходимыми для тестирования мобильных приложений. Провели  анализ запросов по этой теме в разных источниках и разработали программу, которая за короткий срок позволяет получить достаточные технические знания и закрепить полученные навыки на практических занятиях. Самым главным достоинством нашего тренинга считаю наличие в программе информации по тем инструментам, которые востребованы на рынке ИТ и применяются командами в проектах  наших заказчиков.</p>
              <p>С таким набором инструментов и практики у вас будет возможность быстро влиться в тему мобильного тестирования и начать приносить пользу вашему проекту, а также позволит восполнить недостающие знания в теории. Вы имеете возможность украсить свое резюме данными по нашему тренингу, ведь наша компания прошла лицензирование на образовательную деятельность, а значит сертификат нашего учебного центра – это не пустая бумажка, а достойный документ, подтверждающий полученные знания.</p>
              <cite><b>Анастасия Гилевич</b>, создатель тренинга по тестированию мобильных приложений.</cite>
            </blockquote>
          </a-col>
        </a-row>
      </div>
    </div>
    <div class="container">
      <h2 class="h3 mb-20 text-center">{{ title }}</h2>
      <a-collapse class="mb-40">
        <a-collapse-panel header="Какие знания нужны, чтобы начать учиться">
          <p class="mb-10">
            Для старта достаточно полного среднего образования, а также необходимо обладать базовыми знаниями и практическими навыками владения теорией тестирования, понимание клиент-серверной архитектуры (api) и навык работы в баг-трекере.
          </p>
          <p class="mb-10">
            В рамках тренинга по мобильному тестированию вам предстоит работать с подключением мобильных устройств к компьютерам, работой с лог файлами, командной строкой, графическим и консольным интерфейсами, IDE, мобильными и десктопными сетями, клиент-серверной архитектурой, скриншотами, видео и баг-трекером JIRA.
          </p>
          <p class="mb-10">
            Если ваших знаний недостаточно, вам будет затруднительно выполнять практические работы, а тренер не сможет уделять время на пояснение как составить чек-лист или зарегистрировать правильно баг-репорт. Эти пояснения даются в рамках базового тренинга
            <a class="accent-link" @click="openGetCourse(2)">«Хочу стать тестировщиком»</a>
          </p>
          <p class="mb-10">
            Если вы не уверены, что знаете все это в должной мере, мы рекомендуем вам пройти наш базовый тренинг  <a class="accent-link" @click="openGetCourse(2)">«Хочу стать тестировщиком»</a>, где вы сможете приобрести необходимые знания и практические навыки.
          </p>
          <p>
            Также крайне желательно разбираться в клиент-серверной архитектуре и понимать, как работать с консолью браузера, знать принципы работы клиент-серверной архитектуры.
          </p>
        </a-collapse-panel>
        <a-collapse-panel header="Требования к оборудованию">
          <p class="mb-10">
            Для выполнения практических работ на ОС Windows вам потребуется:
          </p>
          <ul class="list--disk mb-10">
            <li>Microsoft Windows 10/8/7/Vista/2003 (32 или 64-bit) </li>
            <li>Процессор i-серии (i3, i5, i7) или аналогичный от AMD</li>
            <li>Оперативная память 4 ГБ (минимум), 8 ГБ (рекомендуется); +2 ГБ для Android Emulator</li>
            <li>Разрешение экрана минимум 1280 x 800</li>
            <li>Свободное место на  жестком диске 10 ГБ (под  Android Studio 2 ГБ минимум (500 МБ для IDE + 1.5 ГБ для Android SDK и образа системы эмулятора), 4 ГБ SSD рекомендуемое)</li>
            <li>Мобильное устройство на платформе Android с OS 5.1 и выше</li>
          </ul>
        </a-collapse-panel>
        <a-collapse-panel header="Длительность тренинга">
          <ul class="list--disk mb-10">
            <li>Суммарная длительность тренинга – 2,5 недели.</li>
            <li>Каждую неделю вы будете проходить 2 занятия и выполнять 2 практические работы.</li>
            <li>На выполнение каждого задания потребуется от 4 до 8 часов (в зависимости от вашей технической подготовки).</li>
            <li>В конце обучения вас ждет итоговое задание, в котором вы отработаете все полученные знания.</li>
          </ul>
          <p class="mb-10">
            4 занятия (2 чистых академических часа теории,  без 30 секундных заставок и «воды») +  много практических заданий для самостоятельной работы + постоянные консультации тренера в чате и ответы на вопросы.
          </p>
          <p class="mb-10">
            По результатам комментариев тренера, можно переделать работу и отправить ее тренеру еще раз, пока не разберетесь в теме.
          </p>
          <p class="mb-10">
            Все выпускники, успешно сдавшие практические и итоговую работы, получают сертификат учебного центра компании «Мир данных ИТ».
          </p>
        </a-collapse-panel>
        <a-collapse-panel header="Стоимость тренинга">
          <p class="mb-10">7000 рублей</p>
        </a-collapse-panel>
        <a-collapse-panel header="Программа тренинга">
          <p class="mb-10"><b>Блок 1</b></p>
          <p class="mb-10"><b>Какие мобильные устройства бывают</b></p>
          <p class="mb-10"><b>Особенности смартфонов</b></p>
          <ul class="list--disk mb-10">
            <li>Операционная система</li>
            <li>Многозадачность</li>
            <li>Многофункциональность</li>
            <li>Интерфейсы</li>
            <li>Фрагментация</li>
          </ul>
          <p class="mb-10"><b>Какие мобильные приложения бывают</b></p>
          <p class="mb-10"><b>Частые дефекты в тестировании мобильных приложений</b></p>
          <ul class="list--disk mb-10">
            <li>Остановка работы приложения</li>
            <li>Ошибки в поддержке разных версий ОС, браузеров и устройств</li>
            <li>Сбои при отображении на экранах разного разрешения</li>
            <li>Дефекты в локализации приложения</li>
            <li>Облачное тестирование мобильного приложения</li>
          </ul>
          <p class="mb-10"><b>Чек-листы проверок мобильных приложений</b></p>
          <ul class="list--disk mb-10">
            <li>Функциональное тестирование</li>
            <li>Тестирование совместимости</li>
            <li>Тестирование безопасности</li>
            <li>Тестирование локализации и глобализации</li>
            <li>Тестирование удобства использования</li>
            <li>Стрессовое тестирование</li>
            <li>Кросс-платформенное тестирование</li>
            <li>Тестирование производительности</li>
          </ul>
          <p class="mb-10"><em>Практическая работа: Подготовительные работы для теста Мобильного приложения</em></p>
          <p class="mb-10"><b>Блок 2</b></p>
          <p class="mb-10"><b>Обмен данными МП и сервера</b></p>
          <p class="mb-10"><b>На чём тестировать МП – Симуляторы, эмуляторы и фермы устройств</b></p>
          <ul class="list--disk mb-10">
            <li>Симуляторы, эмуляторы</li>
          </ul>
          <p class="mb-10"><em>Практическая работа: Выбор мобильного устройства, установка Эмулятора</em></p>
          <ul class="list--disk mb-10">
            <li>Фермы устройств</li>
          </ul>
          <p class="mb-10"><em>Практическая работа: Аренда устройства на ферме устройств</em></p>
          <p class="mb-10"><b>Блок 3</b></p>
          <p class="mb-10"><b>Использование перехватчика трафика (Fiddler)</b></p>
          <p class="mb-10"><b>Операции над запросами в Fiddler</b></p>
          <p class="mb-10"><em>Практическая работа: Учимся перехватывать трафик и работать с ним</em></p>
          <p class="mb-10"><b>Блок 4</b></p>
          <p class="mb-10"><b>Полезные утилиты для тестирования мобильных приложений</b></p>
          <ul class="list--disk mb-10">
            <li>Скриншоты, записи видео с экранов</li>
            <li>Утилиты удаляют системные и пользовательские приложения</li>
            <li>Временная почта</li>
            <li>Сервисы виртуальных номеров телефонов</li>
          </ul>
          <p class="mb-10"><b>Снятие логов</b></p>
          <p class="mb-10"><em>Практическая работа: Используем утилиты для мобильного тестирования</em></p>
          <p class="mb-10"><b>Алгоритм тестирования Мобильных приложений</b></p>
          <ul class="list--disk mb-10">
            <li>Анализ требований</li>
            <li>Планирование тестирования</li>
            <li>Разработка тестов</li>
            <li>Выполнение тестирования</li>
            <li>Анализ результатов</li>
          </ul>
          <p class="mb-10"><em>Итоговая практическая работа: Провести полный цикл тестирования МП версии 2.0</em></p>
        </a-collapse-panel>
      </a-collapse>
    </div>
    <ParCertificate />
    <StartLearning script="2" />
  </section>
</template>

<script>
import TheBanner from "@/components/base/TheBanner";
import TheButton from "@/components/base/TheButton";
import MainForm from "@/components/forms/MainForm";
import StartLearning from "@/components/blocks/StartLearning";
import ParCertificate from "@/components/partials/ParCertificate";
import CountDown from "~/components/base/CountDown";

export default {
  name: "MobileTesters",
  components: {ParCertificate, StartLearning, TheBanner, TheButton, MainForm, CountDown},
  head() {
    return {
      titleTemplate: this.title,
    }
  },
  data() {
    return {
      title: 'Тестирование мобильных приложений',
      end: new Date(2021, 5, 7).getTime(),
    }
  },
  methods: {
    openModal(name) {
      this.$store.commit('toggleModal', name)
    },
    openGetCourse(key) {
      const resolve = this.$router.resolve({ path: `/getcourse/${key}`});
      window.open(resolve.href, '_blank');
    }
  }
}
</script>

<style scoped>

</style>
