<template>
  <div>
    <TheBanner image="/images/banners/computer-1209641_1920.jpg">
      <h1 class="banner-title">Центр разработки «МИР ДАННЫХ ИТ»</h1>
      <a-row type="flex">
        <a-col :xs="24" :md="{span: 12, offset: 6}">
          <h2 class="banner-subtitle h2 text-left mb-20">Сотрудничество с крупными системными интеграторами.</h2>
          <ul class="banner-list">
            <li>Проектирование</li>
            <li>Разработка проектной и эксплуатационной документации</li>
            <li>Тестирование конечного решения</li>
            <li>Сопровождение и эксплуатация внедренных решений от первичного анализа и разработки документации и продукта до тестирования конечного решения</li>
          </ul>
        </a-col>
      </a-row>
    </TheBanner>
    <div class="container py-50">
      <h2 class="h2 text-center mb-30">Мы уже внедрили ряд уникальных разработок в бизнес-процессы наших клиентов. Поможем претворить в жизнь все ваши гениальные идеи.</h2>
      <a-row type="flex">
        <a-col :xs="24" :md="{span: 12, offset: 6}">
          <FormNamePhone
            title="Оставьте контакты. Мы перезвоним."
            button-title="Перезвоните мне"
            button-alight="center"
            :col="1"
          ></FormNamePhone>
        </a-col>
      </a-row>
    </div>
    <TheBanner color="rgb(238, 238, 238)" height="300px" class="fz-20">
      <div class="container">
        <a-row type="flex">
          <a-col :xs="24" :md="{span: 14, offset: 5}" class="text-left">
            <h4 class="h4 mb-30">Удерживаем конкурентоспособные цены на весь спектр услуг</h4>
            <p class="mb-20">Работаем в 9 региноах России: Москва, Севастополь, Тула, Ростов-на-Дону, Челябинск, Калининград, Пушкино, Мытищи, Люберцы, Нижний Новгород и наша география продолжает расширяться.</p>
            <a-button type="primary" @click="openModal('formNameEmailPhone')">Сотрудничество</a-button>
          </a-col>
        </a-row>
      </div>
    </TheBanner>
    <div class="bg-molecular-pattern py-50">
      <div class="container">
        <h3 class="h3 text-center mb-30">{{ $store.getters.birthday }} лет в сфере ИТ разработки </h3>
        <p class="text-center mb-20">Технологические и эксплуатационные требования и уникальность каждого бизнеса - основа нашей работы</p>
        <p class="text-center">Безопасность - NDA</p>
        <p class="text-center mb-30">Взаимодействие - ЭДО</p>
        <p class="text-center">Мы готовы предоставить заказчику максимально подходящий вариант сотрудничества</p>
      </div>
      <div class="container">
        <section class="development-cards py-30">
          <a-row type="flex">
            <a-col :xs="24" :md="8" v-for="(card, key) in cards" :key="key" class="p-15">
              <a-card>
                <img
                  style="height: 380px;"
                  :alt="card.title"
                  :src="card.src"
                  slot="cover"
                />
                <a-card-meta :title="card.title">
                  <template slot="description">{{card.description}}</template>
                </a-card-meta>
              </a-card>
            </a-col>
          </a-row>
        </section>
      </div>
      <section class="bg-fon-1 py-50">
        <div class="container">
          <h4 class="h1 text-center mb-35">Мы предлагаем...</h4>
          <ServiceCard v-for="(card, key) in servicesCard" :key="key"
            :title="card.title"
            :icon="card.icon"
          ><p v-html="card.content"></p></ServiceCard>
        </div>
      </section>
      <section class="py-50">
        <div class="container">
          <ServiceCard v-for="(card, key) in servicesCardDetail" :key="key"
                       :title="card.title"
                       :icon="card.icon"
          ><div v-html="card.content"></div></ServiceCard>
        </div>
      </section>
      <div class="container py-30">
        <BannerCard image="/images/development.page/office-1209640_1280.jpg" style="height: 440px;" class="mb-50" />
        <h4 class="h1 text-center text-uppercase mb-20">Аналитика</h4>
        <p class="mb-20">Техническое задание (ТЗ) - главный инструмент для создания любого продукта. От его качества зависит итоговый результат. Качественное ТЗ включает в себя: определение и формулировку назначения проекта, предметной области, требований (общих и частных) к предмету проекта, состава, содержания работ и требований к ним, порядка контроля и приемки результатов, требований к документированию и другим специфическим аспектам реализации проекта.</p>
        <p class="mb-20">МИР ДАННЫХ ИТ занимается аналитикой и создает качественную проектную документацию, отвечающую высокому уровню предъявляемых к ней требований. Наша команда имеет богатый опыт в сфере создания, доработки, анализа и исправления документации на разных этапах реализации проектов в различных отраслях и сферах.</p>
        <p class="mb-20">Основываясь на многолетний опыт, высокую квалификацию собственной команды аналитиков и эффективное использование ресурсов, мы создаем высококачественное решение, полностью отвечающее всем стандартам и требованиям, предъявляемым к проектной документации.</p>
        <h4 class="h1 text-center text-uppercase mb-20">Технологии</h4>
        <p class="mb-20">Современные, актуальные продукты и платформы ведущих мировых производителей, свободное программное обеспечение с открытым кодом, собственные уникальные разработки, проверенные временем и практикой использования. Для каждого проекта выбирается оптимальное технологическое решение, отвечающее требованиям заказчика, задачам, целям проекта и позволяющее получить в заданных условиях самые высокие результаты</p>
      </div>
    </div>
  </div>
</template>

<script>
  import TheBanner from '~/components/base/TheBanner.vue'
  import FormNamePhone from '~/components/forms/FormNamePhone.vue'
  import ServiceCard from '~/components/base/ServiceCard.vue'
  import BannerCard from '~/components/base/BannerCard.vue'

  export default {
    name: "development",
    data: () => ({
      cards: [
        { title: 'Аутсорсинг',  description: 'Работа наших специалистов в нашем офисе под управлением специалистами Заказчика удаленно', src: '/images/development.page/recruitment-3182373_640.jpg' },
        { title: 'Аутстаффинг',  description: 'Работа наших специалистов в офисе заказчика под управлением специалистами Заказчика', src: '/images/development.page/2.jpg' },
        { title: 'Классический подход',  description: 'Работа по техническому зданию в нашем офисе. Сдача реализованного решения специалистам Заказчика удаленно или в офисе Заказчика', src: '/images/development.page/contract-408216_640.jpg' },
      ],
      servicesCard: [
        { title: 'Заказная разработка', icon: 'data', content: 'Комплекс услуг по разработке программных продуктов различного назначения, для широкого круга предметных областей в соответствии с требованиями, задачами и целями заказчика. В основу концепции разработки проекта могут быть положены как готовые, но усовершенствованные и адаптированные для заказчика решения, так и уникальные идеи, позволяющие эффективно решать нестандартные задачи любой сложности.' },
        { title: 'Тестирование', icon: 'chemistry', content: 'Основываясь на большом опыте и высокой квалификации специалистов, мы предоставляем высококачественные услуги в сфере тестирования и контроля качества программного обеспечения на всех этапах разработки, начиная от анализа требований к проекту и заканчивая вводом в эксплуатацию с последующей поддержкой.' },
        { title: 'Аналитика', icon: 'report', content: 'Создание четкого, понятного и полного по содержанию технического задания – один из ключей к успешной реализации проектов в любой предметной области. Наши специалисты проведут комплексный анализ целей и задач проекта, бизнес-процессов и создадут качественное, полное и детализированное техническое задание, включающее в себя все необходимые аспекты для успешной реализации проекта на последующих этапах сотрудничества.' },
      ],
      servicesCardDetail: [
        { title: '', icon: 'data', content: '<p class="mb-20">В области разработки программного обеспечения на заказ мы предлагаем следующий комплекс услуг:</p><ul class="list--disk "><li>Сбор бизнес-требований;</li><li>Разработка технического задания и подготовка документации по проекту;</li><li>Разработка ПО;</li><li>Внедрение созданного ПО;</li><li>Комплексное тестирование на всех этапах разработки ПО;</li><li>Обучение пользователей ПО в компании заказчика;</li><li>Поддержка и развитие готового решения.</li></ul>' },
        { title: '', icon: 'chemistry', content: '<p class="mb-20">Преимущества заказной разработки программного обеспечения в МИР ДАННЫХ ИТ:</p><ul class="list--disk"><li>Высокое качество конечного решения;</li><li>Разработка только необходимого функционала;</li><li>Выполнение поставленных сроков;</li><li>Возможность доработки и добавления новых функций в готовое решение в дальнейшем;</li><li>Полное соответствие требованиям заказчика;</li><li>Предоставление отчетности на всех этапах разработки;</li><li>Поддержка созданного ПО;</li><li>Ответственность разработчика за готовое решение;</li></ul>' },
        { title: '', icon: 'report', content: '<p class="mb-20">Используя наиболее действенный набор современных инструментальных средств в зависимости от специфики проекта, мы предлагаем все виды тестирования и их подвиды, включая самые востребованные:</p><ul class="list--disk mb-20"><li>Тестирование документации и требований;</li><li>Интеграционное тестирование;</li><li>Автоматизированное тестирование;</li><li>Приемочное тестирование;</li><li>Тестирование миграции;</li><li>Функциональное тестирование;</li><li>Нагрузочное тестирование;</li><li>Тестирование безопасности;</li><li>Регрессионное тестирование;</li><li>и т.д.</li></ul><p>Для создания эффективной работы в цикле тестирования программного обеспечения в комплекс услуг входит построение системы эффективного управления процессом тестирования, включающего в себя квалифицированных менеджеров проектов и тест-менеджеров, обеспечивающих нужный уровень прозрачности и предоставления отчетности на всех этапах проверки, профессиональное программное обеспечение для удовлетворения всех потребностей по тестированию.</p>' },
      ]
    }),
    components: {
      TheBanner, FormNamePhone, ServiceCard, BannerCard
    },
    methods: {
      // formNamePhone formNameEmail formNameEmailPhone
      openModal(name) {
        this.$store.commit('toggleModal', name)
      },
    }
  }
</script>

<style scoped>

</style>
