<template>
  <div class="fon-2 py-30">
    <div class="container font-white">
      <h4 class="h4 text-center text-bold font-white mb-20">Сертификат, стажировка и работа</h4>
      <p class="fz-20 mb-20">Вы получите сертификат о прохождении базового курса после успешного выполнения практических заданий. Если покажете впечатляющие результаты, мы пригласим вас на стажировку, а это прямой путь в команду «Мир данных ИТ».</p>
      <p class="fz-20">Сертификат – это не документ об образовании, а подтверждение того, что вы прошли наш курс. Его можно добавить в резюме, разместить в социальных сетях и на публичных ресурсах. У «Мир данных ИТ» хорошая репутация на рынке, поэтому для работодателей это не только показатель ваших знаний, но и гарантия, что ваше обучение проводилось на самом высоком уровне. </p>
    </div>
  </div>
</template>

<script>
export default {
  name: "ParCertificate"
}
</script>

<style scoped>

</style>
