<template>
  <div class="fon-2 py-30">
    <div class="container font-white">
      <h4 class="h4 text-center text-bold font-white mb-20">СЕРТИФИКАТ для РАБОТОДАТЕЛЯ</h4>
      <p class="text-center fz-20">Сертификат выдается после успешного выполнения всех практических заданий курса. Для работодателя это показатель, что Ваш уровень знаний в тестировании высок. "Мир данных ИТ" имеет хорошую репутацию на рынке ИТ-услуг. Сертификат именно нашей компании продемонстрирует работодателю, что обучение проводилось на таком же высоком уровне как и все, что делает "Мир данных ИТ". Сертификат НЕ является документом об образовании и подтверждает только то, что вы прошли курс. Вы можете разместить ссылку на него в своем резюме, публичных профилях и любых других общедоступных местах, где Вы хотите сообщить о наличии у Вас сертификата.</p>
    </div>
  </div>
</template>

<script>
export default {
  name: "ParCertificate"
}
</script>

<style scoped>

</style>
